Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ДокументыБИА/ДокументыБИА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБИА</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУничтожения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DefinedType.СсылкаНаИнтегрируемыйОбъектБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>DefinedType.ПодразделениеБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DefinedType.ПроектБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уничтожен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭДОДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭДОНаправление</name>
    <comment>Имя значения перечисления НаправленияЭДО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭДОНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЭлектронныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВизыСогласования</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>DefinedType.СотрудникБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.РезультатыСогласованияБИА</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеТабЧасти</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиИсточника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодписиДокумента</name>
    <comment>Бумажные подписи и ПЭП</comment>
    <attributes>
      <name>ВидПодписи</name>
      <type>
        <types>EnumRef.ВидыПодписейДокументовБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДоверенности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеСвойства</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСвойства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСвойства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Резолюции</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>DefinedType.СотрудникБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстРезолюции</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Связи</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязаннаяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязанныйДокумент</name>
      <type>
        <types>CatalogRef.ДокументыБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбратнойСвязиИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбратнойСвязиНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСвязиИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСвязиНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатусыФайловЭДО</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <comment>Имя значения перечисления СтатусыСообщенийЭДО</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>DefinedType.ФизическоеЛицоБИА</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиФайловБИА</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРегламентаЭДО</name>
      <comment>Синоним значения перечисления ТипыЭлементовРегламентаЭДО</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлВизуализации</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/СтатусыОбменаДокументовБИА/СтатусыОбменаДокументовБИА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбменаДокументовБИА</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбменаС1САрхивом</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументБИА</name>
    <type>
      <types>CatalogRef.ДокументыБИА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПакетДокументов</name>
    <type>
      <types>CatalogRef.ПакетыДокументовДля1САрхива</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/Enums/СтатусыОбменаС1САрхивом/СтатусыОбменаС1САрхивом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбменаС1САрхивом</name>
  <enumValues>
    <name>ВыгрузкаВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВАрхивВыполнена</name>
  </enumValues>
  <enumValues>
    <name>НеГотовКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриЗагрузкеВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриПроверкеВАрхиве</name>
  </enumValues>
  <enumValues>
    <name>ПринятВАрхив</name>
  </enumValues>
</mdclass:Enum>

Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ДокументыБИА/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Элементы.ГруппаИнформация.Видимость = Объект.Уничтожен Или Объект.ПометкаУдаления;
	Если Объект.Уничтожен Тогда
		Элементы.ИнформацияНадпись.Заголовок = СтрШаблон(
			НСтр("ru = 'Документ уничтожен в 1С:Архиве %1'"),
			Формат(Объект.ДатаУничтожения, "ДЛФ=Д"));
	ИначеЕсли Объект.ПометкаУдаления Тогда
		Элементы.ИнформацияНадпись.Заголовок = 
			НСтр("ru = 'Документ помечен на удаление'");
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СтатусыОбменаДокументовБИА.Статус, &СтатусНеГотов) КАК Статус,
		|	СтатусыОбменаДокументовБИА.ПакетДокументов КАК Пакет
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
		|		ПО ДокументыБИА.Ссылка = СтатусыОбменаДокументовБИА.ДокументБИА
		|ГДЕ
		|	ДокументыБИА.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СтатусНеГотов", Перечисления.СтатусыОбменаС1САрхивом.НеГотовКВыгрузке);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусОбмена = Выборка.Статус;
		ПакетДокументов = Выборка.Пакет;
	КонецЕсли;
	
	Элементы.ПакетДокументов.Видимость = ЗначениеЗаполнено(ПакетДокументов);
	Элементы.ФормаВключитьВозможностьРедактирования.Видимость =
		ПравоДоступа("Изменение", Метаданные.Справочники.ДокументыБИА);
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность =
		ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(СтатусОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КолСтрок = Объект.ПрочиеСвойства.Количество();
	Элементы.ГруппаПрочиеСвойства.Заголовок = НСтр("ru = 'Прочие свойства'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.ДополнительныеТабЧасти.Количество();
	Элементы.ГруппаДополнительныеТабЧасти.Заголовок = НСтр("ru = 'Дополнительные таблицы'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.Файлы.Количество();
	Элементы.ГруппаФайлы.Заголовок = НСтр("ru = 'Файлы'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.ПодписиДокумента.Количество();
	Элементы.ГруппаПЭПиБумажныеПодписи.Заголовок = НСтр("ru = 'Подписи (ПЭП и бумажные)'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.СубъектыПерсональныхДанных.Количество();	
	Элементы.ГруппаСубъектыПерсональныхДанных.Заголовок = НСтр("ru = 'Субъекты перс. данных'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.Связи.Количество();	
	Элементы.ГруппаСвязи.Заголовок = НСтр("ru = 'Связи'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.ВизыСогласования.Количество();
	Элементы.ГруппаВизыСогласования.Заголовок = НСтр("ru = 'Визы согласования'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.Резолюции.Количество();
	Элементы.ГруппаРезолюции.Заголовок = НСтр("ru = 'Резолюции'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
	КолСтрок = Объект.СтатусыФайловЭДО.Количество();
	Элементы.ГруппаСтатусыФайловЭДО.Заголовок = НСтр("ru = 'Статусы файлов ЭДО'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
		
	КолСтрок = Объект.Штрихкоды.Количество();
	Элементы.ГруппаШтрихкоды.Заголовок = НСтр("ru = 'Штрихкоды'")
		+ ?(КолСтрок = 0, "", " (" + Формат(КолСтрок, "ЧГ=") + ")");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрочиеСвойства

&НаКлиенте
Процедура ПрочиеСвойстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущаяКолонка = Элементы.ФайлыФайл И ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Файл);
	ИначеЕсли ТекущаяКолонка = Элементы.ФайлыФайлВизуализации И ЗначениеЗаполнено(ТекущиеДанные.ФайлВизуализации) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ФайлВизуализации);
	ИначеЕсли ТекущаяКолонка = Элементы.ФайлыРоль И ЗначениеЗаполнено(ТекущиеДанные.Роль) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Роль);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПЭПиБумажныеПодписи

&НаКлиенте
Процедура ПЭПиБумажныеПодписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Файл);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСубъектыПерсональныхДанных

&НаКлиенте
Процедура СубъектыПерсональныхДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФизическоеЛицо) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ФизическоеЛицо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязи

&НаКлиенте
Процедура СвязиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СвязанныйДокумент) Тогда
		ПоказатьЗначение(, ТекущиеДанные.СвязанныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВизыСогласования

&НаКлиенте
Процедура ВизыСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущаяКолонка = Элементы.ВизыСогласованияАвтор И ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Автор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезолюции

&НаКлиенте
Процедура РезолюцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущаяКолонка = Элементы.РезолюцииАвтор И ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Автор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыФайловЭДО

&НаКлиенте
Процедура СтатусыФайловЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Файл);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеТабЧасти

&НаКлиенте
Процедура ДополнительныеТабЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
